{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman Riding Pillion Forced To Take Off Hijab In Madhya Pradesh - NDTV", "description": "A woman riding pillion on a scooter was forced to remove her hijab by some people in Bhopal on Saturday, which led to widespread criticism on social media.", "url": "https://www.ndtv.com/bhopal-news/madhya-pradesh-news-woman-riding-pillion-forced-to-take-off-hijab-in-madhya-pradesh-2578003", "urlToImage": "https://c.ndtvimg.com/2021-10/vankvfp_bhopal-woman_625x300_17_October_21.jpg", "publishedAt": "2021-10-16T19:22:30Z", "content": "Visuals show people taking off her hijab while the woman protested, visibly crying.\r\nBhopal: A woman riding pillion on a scooter was forced to remove her hijab by some people in Bhopal on Saturday, w… [+1606 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "Death in space: What really happens to our bodies - EXPLAINED - HT Tech", "description": "Commercial space company Blue Origin has already started sending paying customers on sub-orbital flights. And Elon Musk hopes to start a base on Mars with his firm SpaceX. This means we need to start thinking about what it will be like to live in space – but …", "url": "https://tech.hindustantimes.com/tech/news/death-in-space-what-really-happens-to-our-bodies-explained-71634411675813.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/10/16/1600x900/TESLA-BERLIN-OPENING-0_1634411904256_1634411962744.JPG", "publishedAt": "2021-10-16T19:14:35Z", "content": "As space travel for recreational purposes is becoming a very real possibility, there could come a time when we are travelling to other planets for holidays, or perhaps even to live.\r\nCommercial space… [+4539 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustantimes", "title": "Two more Nihangs held for murder of man at farmers’ protest site at Singhu border - Hindustan Times", "description": "The deceased man, identified as Lakhbir Singh, 35, was found hanging on a police barricade with his left arm chopped off, on Friday morning. Police said that Lakhbir used to work as a labourer and was found with at least 10 wounds. | Latest News India", "url": "https://www.hindustantimes.com/india-news/2-more-nihangs-held-for-murder-of-man-at-farmers-protest-site-at-singhu-border-101634405384615.html", "urlToImage": "https://images.hindustantimes.com/img/2021/10/16/1600x900/two_more_nihangs_detained_singhu_border_killing_1634405753482_1634405753671.png", "publishedAt": "2021-10-16T17:40:41Z", "content": "Haryana Police have detained two more Nihangs in connection with the killing of the Tarn Taran man at the farmers protest site at Delhis Singhu border. According to a video shared by news agency ANI,… [+1745 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "India vs Nepal, SAFF Championship 2021 final highlights: India become champions after 3-0 victory - Firstpost", "description": "SAFF Championship 2021: India vs Nepal, SAFF Championship 2021 final Match IND vs NEP Live Score Updates from the SAFF Championship final between India and Nepal Watch LIVE News, Latest Updates, Live blog, Highlights and Live coverage  IND vs NEP football cla…", "url": "https://www.firstpost.com/sports/india-vs-nepal-saff-championship-2021-final-highlights-india-become-champions-after-3-0-victory-10059191.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/10/Football_opt.jpg", "publishedAt": "2021-10-16T17:17:46Z", "content": "Catch the live score and updates from the SAFF Championship 2021 final between India and Nepal\r\n Preview: It has been a tough ride but Igor Stimac's India will hope to leave Maldives with the SAFF Ch… [+1697 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Nick Pino", "title": "Roku Streaming Stick 4K (2021) vs Amazon Fire TV Stick 4K Max: which should you buy? - Techradar", "description": "The battle of the superlative streaming sticks", "url": "https://www.techradar.com/news/roku-streaming-stick-4k-2021-vs-amazon-fire-tv-stick-4k-max", "urlToImage": "https://cdn.mos.cms.futurecdn.net/sxusMj2Nrw6CaTqDgDmk4d-1200-80.jpg", "publishedAt": "2021-10-16T17:00:25Z", "content": "Not sure whether you want to buy a new Roku Streaming Stick 4K or a new Amazon Fire TV Stick 4K Max? We don’t blame you. It’s actually kind of confusing.\r\nThe reason for that is both Roku and Amazon … [+6460 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "PTI", "title": "Aryan Khan tells NCB officials `I will work for poor, shun wrong path` during counselling in prison - Zee News", "description": "Bollywood actor Shah Rukh Khan s son Aryan Khan assured NCB officials during counselling that he would work for the welfare of the poor and never do anything that would besmirch his name in the future, an official said on Saturday.", "url": "https://zeenews.india.com/people/aryan-khan-tells-ncb-officials-i-will-work-for-poor-shun-wrong-path-during-counselling-in-prison-2403193.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/10/16/980047-aryan-khan.jpg", "publishedAt": "2021-10-16T16:54:05Z", "content": "Mumbai: Bollywood actor Shah Rukh Khan's son Aryan Khan assured NCB officials during counselling that he would work for the welfare of the poor and never do anything that would besmirch his name in t… [+899 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Nasa mission to seek out Solar System 'fossils' - BBC News - BBC News", "description": "A spacecraft has launched from Cape Canaveral on a mission to uncover \"the fossils\" of the Solar System.The Lucy probe will head out to the orbit of Jupiter ...", "url": "https://www.youtube.com/watch?v=eDZjkQOWv3o", "urlToImage": "https://i.ytimg.com/vi/eDZjkQOWv3o/maxresdefault.jpg", "publishedAt": "2021-10-16T16:37:35Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "J&K: Two from UP, Bihar shot dead by militants in Srinagar; 2 soldiers dead in Poonch - The Indian Express", "description": "Meanwhile, the grandson of pro-Pakistan separatist leader Syed Ali Shah Geelani was terminated from government service on Saturday for allegedly aiding terrorist activities in Jammu and Kashmir", "url": "https://indianexpress.com/article/india/jk-militant-shot-dead-non-local-vendor-srinagar-7575266/", "urlToImage": "https://images.indianexpress.com/2021/10/poonch-2.jpg", "publishedAt": "2021-10-16T16:34:51Z", "content": "A WEEK after a series of attacks on civilians, especially non-Muslims, set off alarm bells from Srinagar to Delhi, militants struck again on Saturday evening, killing two non-locals.While Arvind Kuma… [+4030 chars]"}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "PragativadiNews", "title": "NASA's Hubble Finds Evidence Of Water Vapor On Europa But In Only One Hemisphere - Pragativadi", "description": "NASA's Hubble Space Telescope observations of Jupiter's icy moon Europa have revealed the presence of persistent water vapor – but, mysteriously, only in one hemisphere.Europa harbors a vast ocean underneath its icy surface, which might offer conditi", "url": "https://pragativadi.com/nasas-hubble-finds-evidence-of-water-vapor-on-europa-but-in-only-one-hemisphere/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2021/10/stsci-01fhref5sgr4pfn9cytcvkt8gq.jpg", "publishedAt": "2021-10-16T16:15:48Z", "content": "NASA’s Hubble Space Telescope observations of Jupiter’s icy moon Europa have revealed the presence of persistent water vapor but, mysteriously, only in one hemisphere.\r\nEuropa harbors a vast ocean un… [+3401 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Dead, Many Missing After Kerala Rain Triggers Floods, Landslides - NDTV", "description": "Heavy rain in parts of Kerala has triggered landslides in Idukki and Kottayam districts. At least five people have been killed in rain-related incidents. The weather office has predicted heavy to very heavy rain till tomorrow morning.", "url": "https://www.ndtv.com/india-news/5-dead-many-missing-after-kerala-rain-triggers-floods-landslides-2577774", "urlToImage": "https://c.ndtvimg.com/2021-10/umtlq2hg_kerala-rain_625x300_16_October_21.jpg", "publishedAt": "2021-10-16T15:56:00Z", "content": "<li>At least five people were killed in rain-related incidents as several parts of Kerala received a downpour today.\r\n</li>\r\n<li>Landslides have been reported in Kottayam and Idukki districts. Twelve… [+1366 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "In Andamans, Amit Shah rechristens island as ‘Mount Manipur’, says Bose, Patel didn’t get their due - The Indian Express", "description": "The Union home minister said that the Manipur government has plans to build a memorial at the spot and he added that the memorial will inspire tourists, the youth and the younger generation across the country on how to fight with limited resources.", "url": "https://indianexpress.com/article/india/andamans-amit-shah-rechristens-island-mount-manipur-7575285/", "urlToImage": "https://images.indianexpress.com/2021/10/PTI10_14_2021_000187B.jpg", "publishedAt": "2021-10-16T15:40:53Z", "content": "Claiming that several freedom fighters, including Netaji Subhash Chandra Bose and Sardar Vallabhbhai Patel, were not given their due in independent India, Home Minister Amit Shah on Saturday said tha… [+3284 chars]"}, {"source": {"id": null, "name": "Www.bgr.in"}, "author": "Karanveer Singh Arora", "title": "Phones launching in India next week: Google Pixel 6, Samsung Galaxy S21 FE, OnePlus 9RT and more - BGR India", "description": "Here we will be taking a look at the list of smartphones releasing in the next week including Pixel 6, Samsung Galaxy S21 FE, OnePlus 9RT and more.", "url": "https://www.bgr.in/photo-gallery/phones-launching-in-india-next-week-google-pixel-6-samsung-galaxy-s21-fe-oneplus-9rt-motorola-edge-s-asus-8z-1015031/", "urlToImage": "https://st1.bgr.in/wp-content/uploads/2021/10/Google-Pixel-6-4.jpg", "publishedAt": "2021-10-16T15:33:00Z", "content": "BGR is a leading online destination for news and commentary focused on the mobile and general consumer electronics markets. It is Americas number one source of exclusive and breaking mobile news, and… [+168 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sanjay Khajuria", "title": "J&K: Bodies of 2 more soldiers recovered from Poonch-Rajouri encounter area, toll now 9 - Times of India", "description": "India News: The encounter in J&K's Poonch has now claimed the lives of nine soldiers, with recovery of two more bodies on Saturday. Bodies of a junior commiss", "url": "https://timesofindia.indiatimes.com/india/jk-bodies-of-2-more-soldiers-recovered-from-poonch-rajouri-encounter-area-toll-now-9/articleshow/87065637.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-87065649,width-1070,height-580,imgsize-1588528,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-10-16T15:23:00Z", "content": "Intel gets info on new ISI-backed terrorist front and hit list of 200The Indian intelligence establishment has been alerted about Pakistan-based groups floating a new tanzeem (terror organisation) th… [+169 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vivek Deshpande", "title": "After repealing Article 370, need efforts now to integrate Kashmiris with rest of country: Mohan Bhagwat - The Indian Express", "description": "Mohan Bhagwat also called for the return of all those who had been \"forced to leave Kashmir\" during Sheikh Abdullah's time. “The sense of belonging must be on display from both sides,” he said.", "url": "https://indianexpress.com/article/india/article-370-kashmir-india-mohan-bhagwat-7575290/", "urlToImage": "https://images.indianexpress.com/2021/10/Mohan-Bhagwat-2.jpg", "publishedAt": "2021-10-16T15:13:44Z", "content": "Rashtriya Swayamsevak Sangh (RSS) chief Mohan Bhagwat on Saturday said that repealing Article 370 may have removed many obstacles, but efforts need to be put in to integrate people from Kashmir with … [+2775 chars]"}, {"source": {"id": null, "name": "Cricketaddictor.com"}, "author": null, "title": "No Idea Exactly What's Happening – Virat Kohli On Reports Of Rahul Dravid Becoming India's Head Coach - Cricket Addictor", "description": "Virat Kohli said he has no idea about Rahul Dravid becoming the next Head Coach of India after the tenure of current Head Coach Ravi Shastri ends", "url": "https://cricketaddictor.com/cricket-news/no-idea-exactly-whats-happening-virat-kohli-on-reports-of-rahul-dravid-becoming-indias-head-coach/", "urlToImage": "https://cricketaddictor.com/wp-content/uploads/2021/07/Rahul-Dravid-and-Virat-Kohli.jpg", "publishedAt": "2021-10-16T15:04:13Z", "content": "The all-format captain of the India National Cricket Team Virat Kohli said he has no idea about Rahul Dravid becoming the next Head Coach of India after the tenure of current Head Coach Ravi Shastri … [+2021 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "Watch: MS Dhoni Gets An Adorable Hug From Sakshi, Ziva After IPL Win - NDTVSports.com", "description": "MS Dhoni received an adorable hug from his wife Sakshi and daughter Ziva after the former India captain led Chennai Super Kings to their fourth Indian Premier League (IPL) title.", "url": "https://sports.ndtv.com/ipl-2021/ms-dhoni-gets-an-adorable-hug-from-sakshi-ziva-after-ipl-win-watch-2577795", "urlToImage": "https://c.ndtvimg.com/2021-10/qne48b48_ms-dhoni-with-family-bcciipl_625x300_16_October_21.jpg", "publishedAt": "2021-10-16T14:56:48Z", "content": "MS Dhoni received an adorable hug from his wife Sakshi and daughter Ziva after the former India captain led Chennai Super Kings to their fourth Indian Premier League (IPL) title. After CSK successful… [+1080 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "IMD issues yellow and orange rain alert for these states, predicts thunderstorms, lightning - Moneycontrol.com", "description": "Isolated heavy to very heavy rainfall is also very likely over South Interior Karnataka, Telangana and Tamil Nadu, Puducherry & Karaikal on October 16, IMD said.", "url": "https://www.moneycontrol.com/news/trends/imd-issues-yellow-and-orange-rain-alert-for-these-states-predicts-thunderstorms-lightning-7589331.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/09/Delhi-rains-1-653x435.jpg", "publishedAt": "2021-10-16T14:48:18Z", "content": "The India Meteorological Department (IMD) on October 16 said that these states is likely to receive light rain and thunderstorm in the coming days.\r\nThe IMD has predicted rainfall and thundershower i… [+1852 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Breast Cancer Awareness Month: 5-step self-examination guide you must follow - Hindustan Times", "description": "Breast Cancer Awareness Month: One of the most common cancers in women, breast cancer can be treated successfully if detected at an early stage. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/breast-cancer-awareness-month-5-step-self-examination-guide-to-rule-out-lumps-101634391370131.html", "urlToImage": "https://images.hindustantimes.com/img/2021/10/16/1600x900/breast_cancer_thumb_1634391964783_1634391977571.jpg", "publishedAt": "2021-10-16T13:50:56Z", "content": "The number of breast cancer cases have been rising at an alarming rate across the globe. One of the most common cancers in women, breast cancer can be treated successfully if detected at an early sta… [+2806 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Abhijit Lele", "title": "HDFC Bank Q2 net up 18% to Rs 8,834 cr, steady rise in interest, fee income - Business Standard", "description": "Asset quality is largely stable; Total deposits up 14.4% at Rs 14.06 trillion YoY, advances rise 15.5% to Rs nearly Rs 12 trillion", "url": "https://www.business-standard.com/article/companies/q2-results-hdfc-bank-consolidated-profit-rises-18-to-rs-9-096-crore-121101600665_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-09/21/full/1632197477-0197.jpg", "publishedAt": "2021-10-16T13:38:23Z", "content": "The country's largest private lender, HDFC Bank, posted a 17.6 per cent rise in net profit at Rs 8,834.3 crore in the second quarter ended September 30, 2021, on robust growth in income streams inclu… [+3728 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Children can be superspreaders of COVID-19 and its variants, study finds - Times of India", "description": "In many parts of the world, children below the age of 18 still do not have access to COVID-19 vaccines. Not only does it make them more vulnerable to the virus, but they can also become potential spreaders of the disease.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-children-can-be-superspreaders-of-covid-19-and-its-variants-study-finds/photostory/87059961.cms", "urlToImage": "https://static.toiimg.com/photo/87059981.cms", "publishedAt": "2021-10-16T13:30:00Z", "content": "According to the study, published in the Journal of Infectious Diseases, the high levels of virus correspond with live, infectious virus, and that levels are highest early in the illness in both symp… [+877 chars]"}]}