{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": null, "name": "Republic World"}, "author": "Digital Desk", "title": "Garena Free Fire redeem codes for February 7, 2022: Redeem latest FF reward using codes - Republic World", "description": "The developers of the game keep revealing Garena Free Fire redeem codes, which can be redeemed by players to gather rare in-game supplies from the website.", "url": "https://www.republicworld.com/technology-news/gaming/garena-free-fire-redeem-codes-for-february-7-2022-redeem-latest-ff-reward-using-codes-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/ev4cfgi49mmu3t3n_1644200640.jpeg", "publishedAt": "2022-02-07T04:30:00Z", "content": "Garena Free Fire is an adventure-driven battle royale game, which gained a lot of popularity during the absence of Pubg Mobile India. Now it is becoming one of the most popular mobile games in the wo… [+2940 chars]"}, {"source": {"id": null, "name": "The Sentinel Assam"}, "author": "Sentinel Digital Desk", "title": "Pandemic widens screening gap among cancer patients - Sentinelassam - The Sentinel Assam", "description": "The ongoing Covid pandemic has disrupted healthcare systems globally leading to widening the gap...", "url": "https://www.sentinelassam.com/national-news/pandemic-widens-screening-gap-among-cancer-patients-576854", "urlToImage": "https://assets.sentinelassam.com/h-upload/2022/02/07/308517-pandemic.jpg", "publishedAt": "2022-02-07T04:06:20Z", "content": "NEW DELHI: The ongoing Covid pandemic has disrupted healthcare systems globally leading to widening the gap between treatment and patient care of non-Covid disease including cancer. Cancer is a major… [+3170 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Opposed To \"Unilateral Actions\" On Kashmir: China After Xi-Imran Khan Meet - NDTV", "description": "China on Sunday pledged closer cooperation with Pakistan under the USD 60 billion CPEC investment programme and called for resolving the Kashmir issue properly and peacefully while opposing any \"unilateral actions\" that could complicate the situation", "url": "https://www.ndtv.com/india-news/opposed-to-unilateral-actions-to-resolve-kashmir-issue-chinas-xi-jinping-in-meet-with-imran-khan-2753239", "urlToImage": "https://c.ndtvimg.com/2019-06/o9oduu5_imran-khan-xi-jinping-sco-summit-bishkek-twitter_625x300_14_June_19.jpg", "publishedAt": "2022-02-07T04:06:00Z", "content": "This is Imran Khan's fourth visit to China as he paid last visit in October 2019.\r\nBeijing: China on Sunday pledged closer cooperation with Pakistan under the USD 60 billion CPEC investment programme… [+6624 chars]"}, {"source": {"id": null, "name": "Www.bgr.in"}, "author": "Sneha Saha", "title": "Google Chrome logo is changing after 8 years, for good - BGR India", "description": "Google Chrome logo is changing for the first time in eight years. The last time Google tweaked its Chrome logo is in 2014. Take a look.", "url": "https://www.bgr.in/news/google-chrome-logo-change-check-new-look-here-rollout-timeline-1042353/", "urlToImage": "https://st1.bgr.in/wp-content/uploads/2022/02/Google-Chrome-logo.jpg", "publishedAt": "2022-02-07T03:33:10Z", "content": "A big update is coming for billions of Google Chrome users worldwide. Elvin Hu, a designer for Google Chrome, revealed a new logo for the web browser last week. The logo looks more vibrant and eye-ca… [+3238 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "To Avert Russia-NATO Clash Over Ukraine, Global Diplomacy Works Overtime - NDTV", "description": "With war clouds gathering over Ukraine, international diplomacy goes into overdrive on Monday with the French and Russian presidents to meet in Moscow and the German chancellor heading to the White House to meet with US leader Joe Biden.", "url": "https://www.ndtv.com/world-news/to-avert-russia-nato-clash-over-ukraine-global-diplomacy-works-overtime-2753246", "urlToImage": "https://c.ndtvimg.com/2022-02/srrg8e3o_ukraine_625x300_07_February_22.jpg", "publishedAt": "2022-02-07T03:23:08Z", "content": "\"We have sent forces to Europe to defend NATO territory,\" said US National Security Advisor Jake Sullivan\r\nMoscow: With war clouds gathering over Ukraine, international diplomacy goes into overdrive … [+3371 chars]"}, {"source": {"id": null, "name": "PINKVILLA"}, "author": "Pinkvilla Desk", "title": "Kim Kardashian, Hailey Bieber and more send LOVE to Kylie Jenner and Travis Scott on second baby's arrival - PINKVILLA", "description": "Kylie Jenner and Travis Scott received congratulatory messages on Instagram as they welcomed their second baby.", "url": "https://www.pinkvilla.com/entertainment/hollywood/kim-kardashian-hailey-bieber-and-more-send-love-kylie-jenner-and-travis-scott-second-babys-arrival-1016807", "urlToImage": "https://www.pinkvilla.com/files/styles/fbimagesection/public/kylie_travis_kim_social.jpeg?itok=ePnUnY_e", "publishedAt": "2022-02-07T03:11:18Z", "content": "Kylie Jenner and Travis Scott have become parents again. The couple welcomed their second baby on February 2, 2022 and the news of the little one's arrival was recently confirmed by Kylie who shared … [+1363 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "SHOCKING! Woman orders iPhone 13 Pro Max, gets hand soap bottle instead - HT Tech", "description": "In a shocking case, a UK woman has received a bottle of hand soap instead of the £1,500 iPhone 13 Pro Max she had paid for. Needless to say, she is frothing angry.", "url": "https://tech.hindustantimes.com/tech/news/shocking-woman-orders-iphone-13-pro-max-gets-hand-soap-bottle-instead-71644202476265.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/07/1600x900/Untitled_design_-_2022-02-07T082836.064_1644202731847_1644202743773.jpg", "publishedAt": "2022-02-07T03:02:06Z", "content": "What will you do if you order something very expensive from an ecommerce website and you end up getting a very different, and extremely cheap, product? There are several instances where people have p… [+2409 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Ukraine crisis: New satellite images show S-400, Iskander missiles in Belarus - Hindustan Times", "description": "Russia has repeatedly denied claims that it is planning to attack Ukraine. Kyiv too has sought to play down \"apocalyptic predictions\", but western countries claim that Moscow will increase troop deployment till Putin gets the firepower he needs for a full-sca…", "url": "https://www.hindustantimes.com/world-news/ukraine-crisis-new-satellite-images-show-s-400-iskander-missiles-in-belarus-101644201172560.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/07/1600x900/ukraine_crisis_troop_buildup_1644201815594_1644201820479.JPG", "publishedAt": "2022-02-07T02:52:14Z", "content": "A set of fresh satellite images released by an American company on Sunday showed details of military maneuvers at the Belarus border with Ukraine. The images also showed that Russia has advanced depl… [+3854 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Asha Bhosle shares childhood pic with Lata Mangeshkar, dedicates her song 'Bachpan Ke Din'; Hrithik Roshan reacts - Hindustan Times", "description": "After her legendary singer Lata Mangeshkar's death, her sister and veteran singer Asha Bhosle shared a childhood picture with her on social media.", "url": "https://www.hindustantimes.com/entertainment/music/asha-bhosle-shares-childhood-pic-with-lata-mangeshkar-dedicates-her-song-bachpan-ke-din-hrithik-roshan-reacts-101644198872910.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/07/1600x900/lata-asha_1644200695843_1644200713179.jpg", "publishedAt": "2022-02-07T02:34:31Z", "content": "Veteran singer Asha Bhosle has shared a rare picture with her late sister Lata Mangeshkar on Instagram. The Bharat Ratna recepient died on Sunday, leaving the entire nation in grief. \r\nSharing the ch… [+1833 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Entertainment Bureau", "title": "Shah Rukh Khan Snapped Reading Dua At Lata Mangeshkar's Last Rites, Fans Call It 'Pic of The Day' - News18", "description": "Lata Mangeshkar was laid to rest with full state honours on Sunday.", "url": "https://www.news18.com/news/movies/shah-rukh-khan-snapped-reading-dua-at-lata-mangeshkars-last-rites-fans-call-it-picture-of-the-day-4743407.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/pjimage-20-164420090316x9.jpg", "publishedAt": "2022-02-07T02:29:00Z", "content": "Legendary singer Lata Mangeshkar’s last rites were held on Sunday evening in Mumbai’s Shivaji Park. She was laid to rest with full state honours. Apart from thousands of teary-eyed fans, several dign… [+2258 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Schools, Colleges Reopen In Delhi, 4 Other States As Covid Cases Drop - NDTV", "description": "Schools in the national capital will reopen for classes 9 to 12 from Monday after a spurt in COVID-19 cases had led to their closure in December, even as stakeholders debated the continuing of hybrid teaching and learning mode.", "url": "https://www.ndtv.com/india-news/delhi-school-reopening-schools-colleges-reopen-in-delhi-4-other-states-as-covid-cases-drop-2753219", "urlToImage": "https://c.ndtvimg.com/2022-02/r9396i2c_delhi-school-reopen_625x300_07_February_22.jpg", "publishedAt": "2022-02-07T02:28:54Z", "content": "Students arrive to attend classes at Sarvodaya Kanya Vidyalaya, Delhi Cantonment\r\nNew Delhi: Schools in Delhi and four other states reopened from Monday after a surge in Covid cases had led to their … [+1194 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Emergency In Canada's Ottawa Over Truckers' Protest Against Covid Jabs - NDTV", "description": "The ongoing truckers' protest in the Canadian capital is \"out of control,\" the Ottawa mayor said Sunday, announcing a state of emergency as the city center remained blocked by opponents of anti-Covid measures.", "url": "https://www.ndtv.com/world-news/state-of-emergency-declared-in-canadas-ottawa-over-truckers-covid-vaccine-mandate-protest-2753172", "urlToImage": "https://c.ndtvimg.com/2022-01/s9dd1qc_canada-truckers-vaccine-mandate-protest-afp_625x300_30_January_22.jpg", "publishedAt": "2022-02-07T02:28:00Z", "content": "Ottawa Mayor Jim Watson has earlier described the protests as \"completely out of control\".\r\nMontreal: The ongoing truckers' protest in the Canadian capital is \"out of control,\" the Ottawa mayor said … [+3382 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Priya Kumari", "title": "iPhone 13 Price Drop: Amazon, Flipkart offer Rs. 5000 discount- Check details - HT Tech", "description": "Apple iPhone 13 price drop has been announced on Amazon and Flipkart. The ecommerce websites are also offering other deals on the same. Check details here.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-13-price-drop-amazon-flipkart-offer-rs-5000-discount-check-details-71644200231028.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/07/1600x900/Untitled_design_-_2022-02-07T075345.044_1644200634169_1644200647312.jpg", "publishedAt": "2022-02-07T02:26:37Z", "content": "Buying an all new iPhone 13 and that too at a discounted price! Sounds exciting and attractive right? There are several ecommerce websites along with Apple's official website from where you can buy t… [+2709 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Sandeep Singh", "title": "Trade setup for Feb 7: Can Nifty make a comeback soon? Check out key market cues before Monday’s opening bell - CNBCTV18", "description": "Trade setup for Monday, February 7: The Nifty50 appears to have entered a consolidation phase after the Budget, say experts. Here's what the technical charts suggest for the coming session on Dalal Street.", "url": "https://www.cnbctv18.com/market/stocks/trade-setup-feb-7-nse-nifty-chart-next-target-sensex-bank-nifty-top-stocks-call-put-options-stock-market-trading-guide-12383552.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/11/NSE-1019x573.jpg", "publishedAt": "2022-02-07T02:19:00Z", "content": "MiniTrade setup for Monday, February 7: The Nifty50 appears to have entered a consolidation phase after the Budget, say experts. Here's what the technical charts suggest for the coming session on Dal… [+9 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Arindam Roy", "title": "Stocks to Watch: GSK, SBI, TVS Motor, Indian Bank, P&SB - Mint", "description": "Shares of firms like Glaxosmithkline Pharmaceuticals, Union Bank of India, Indian Bank, TVS Motor Company, Chemcon Speciality Chemicals, JM Financial, Jindal Stainless, Punjab & Sind Bank, Sansera Engineering, Tarsons Products, Minda Industries, Tube Investme…", "url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-gsk-tvs-motor-indian-bank-psb-11644198462274.html", "urlToImage": "https://images.livemint.com/img/2022/02/07/600x338/stock-kpeE--621x414@LiveMint_1644199022795.jpg", "publishedAt": "2022-02-07T02:00:58Z", "content": "SBI: The country's largest lender State Bank of India (SBI) on Saturday reported 62.27 per cent jump in standalone net profit at 8,432 crore for the quarter ended December 2021, helped by lower provi… [+3254 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Lata Mangeshkar death: Towards the end, video calls with doctor’s 8-year-old - The Indian Express", "description": "For doctors and nurses at Breach Candy, the passing away of Lata Mangeshkar in the hospital was personal. “Today, my little daughter is grieving,” said Dr Pratit Samdani, internal medicine specialist and consultant at the hospital.", "url": "https://indianexpress.com/article/entertainment/bollywood/towards-the-end-video-calls-with-doctors-8-year-old-7760212/", "urlToImage": "https://images.indianexpress.com/2022/02/lata-mangeshkar-4-2.jpg", "publishedAt": "2022-02-07T01:54:48Z", "content": "THEY WOULD speak about life, songs, studios, recordings, families even her payal (anklet) collection. Over the last two years, she grew so close to one of them that she would chat with his eight-year… [+3327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, February 7, 2022: Virgo, Aries, Pisces and other signs — check astrological prediction - The Indian Express", "description": "Libra -- Your lunar alignments encourage an unusual and independent point of view. You may also, as it happens, devote as much time as is necessary to sorting out domestic problems.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-february-7-2022-virgo-aries-pisces-and-other-signs-check-astrological-prediction-7760287/", "urlToImage": "https://images.indianexpress.com/2022/02/HOROROR-1.jpg", "publishedAt": "2022-02-07T01:20:03Z", "content": "Dreams, imagination and intuition are important at the moment and are vital to any solution to practical problems, but you can’t get away without hard, practical work. You may also look closely at do… [+3469 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Charanjit Channi Touches Navjot Sidhu's Feet, Sends A Message - NDTV", "description": "Charanjit Singh Channi is Congress's presumptive Chief Minister in Punjab, Rahul Gandhi announced on Sunday afternoon, with Navjot Sidhu slipping out of the hotly contested race for the top job.", "url": "https://www.ndtv.com/india-news/charanjit-channis-outreach-to-navjot-sidhu-after-big-reveal-2752508", "urlToImage": "https://c.ndtvimg.com/2022-02/kbq606ns_channi-touching-feet-650_625x300_06_February_22.jpg", "publishedAt": "2022-02-07T00:50:00Z", "content": "New Delhi: Charanjit Singh Channi is Congress's presumptive Chief Minister in Punjab, Rahul Gandhi announced on Sunday afternoon, with Navjot Sidhu slipping out of the hotly contested race for the to… [+1839 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Holiday in Maharashtra today: Schools, colleges, offices to remain closed - Mint", "description": "To mourn the demise of Lata Mangeshkar, the Maharashtra government announced a public holiday in the state today, 7 February 2022", "url": "https://www.livemint.com/news/holiday-in-maharashtra-today-schools-colleges-offices-to-remain-closed-11644193102431.html", "urlToImage": "https://images.livemint.com/img/2022/02/07/600x338/Maharashtra_holiday_today_1644194042742_1644194043129.jpg", "publishedAt": "2022-02-07T00:35:39Z", "content": "Maharashtra government on Sunday announced a public holiday in the state on Monday to mourn the demise of the legendary singer Lata Mangeshkar, who died due to multiple organ failure in Mumbai on Sun… [+3023 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Asaduddin Owaisi car attack: Amit Shah to make statement in Parliament today - Hindustan Times", "description": "Owaisi's car came under attack at a tollbooth in the Hapur district of Uttar Pradesh while the Lok Sabha MP was on his way to New Delhi after campaigning in Meerut. | Latest News India", "url": "https://www.hindustantimes.com/india-news/asaduddin-owaisi-car-attack-amit-shah-to-make-statement-in-parliament-today-101644192078396.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/07/1600x900/amit_shah_reply_in_parliament_on_attack_on_owaisi_1644193887781_1644193888031.jpg", "publishedAt": "2022-02-07T00:34:58Z", "content": "Union home minister Amit Shah will today make a statement in both Houses of Parliament regarding the attack on the convoy of All India Majlis-E-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi in U… [+1582 chars]"}]}