{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Joshua Zitser", "title": "Rudy Giuliani was so drunk he almost smashed White House china: Wolff - Business Insider", "description": "According to Michael Wolff, Rudy Giuliani struggled to keep his balance while trying to convince others that Trump had won re-election on November 3.", "url": "https://www.businessinsider.com/rudy-giuliani-so-drunk-almost-smashed-white-house-china-wolff-2021-7", "urlToImage": "https://i.insider.com/60f294b77b0ec5001800aa29?width=1200&format=jpeg", "publishedAt": "2021-07-17T09:31:09Z", "content": "Rudy Giuliani was so drunk on election night that former President Donald Trump's aides were concerned he'd accidentally smash valuable White House china, presidential biographer Michael Wolff told M… [+1541 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Andrew Romano", "title": "Poll: Americans oppose new Texas-style GOP voting restrictions, prefer Democratic reforms - Yahoo News", "description": "As the national debate over voting rights intensifies, the Democratic Party’s plan to safeguard ballot access is proving more popular with the public than...", "url": "https://news.yahoo.com/poll-americans-oppose-new-texas-style-gop-voting-restrictions-prefer-democratic-reforms-090031824.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-07/7df95200-e66c-11eb-bffd-04201e91cee6", "publishedAt": "2021-07-17T09:00:31Z", "content": "As the national debate over voting rights intensifies, the Democratic Partys plan to safeguard ballot access is proving more popular with the public than the type of restrictions being pushed by Texa… [+7404 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Anthony Bourdain's voice-cloning for new doc called into question: It's 'a slippery slope' - Fox News", "description": "Filmmaker Morgan Neville's choice to recreate Anthony Bourdain's voice for a recent documentary using artificial intelligence has been called into question.", "url": "https://www.foxnews.com/entertainment/anthony-bourdain-voice-cloning-called-into-question", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/Anthony-Bourdain-1.jpg", "publishedAt": "2021-07-17T08:44:12Z", "content": "The revelation that a documentary filmmaker used voice-cloning software to make the late chef Anthony Bourdain say words he never spoke has drawn criticism amid ethical concerns about use of the powe… [+5523 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "Covid-19 risk for some unvaccinated people is higher than it's ever been, expert says - CNN ", "description": "Expectations that the US would find itself returning to a pre-pandemic normalcy this summer are quickly giving way to the realities of a prolonged fight against Covid-19, as a rise in infections had now been recorded in all 50 states.", "url": "https://www.cnn.com/2021/07/17/health/us-coronavirus-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210717004722-springfield-mo-vaccination-0622-restricted-super-tease.jpg", "publishedAt": "2021-07-17T07:24:00Z", "content": "(CNN)Expectations that the US would find itself returning to a pre-pandemic normalcy this summer are quickly giving way to the realities of a prolonged fight against Covid-19, as a rise in infections… [+7601 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Top 10 Giannis Antetokounmpo BIG-TIME Rejections at the Rim! - NBA", "description": null, "url": "https://news.google.com/__i/rss/rd/articles/CBMiK2h0dHBzOi8vd3d3LnlvdXR1YmUuY29tL3dhdGNoP3Y9N0RJR0dvYXNwcFXSAQA?oc=5", "urlToImage": null, "publishedAt": "2021-07-17T07:00:01Z", "content": null}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Geir Moulson", "title": "Death toll from Europe floods tops 150 as water recedes - Associated Press", "description": "BERLIN (AP) — The death toll from disastrous flooding in Western Europe rose above 150 on Saturday as rescue workers toiled to clear up the devastation revealed by receding water and prevent further damage.", "url": "https://apnews.com/article/europe-floods-954655c9382a9b8c12a230bdd8cd5b3e", "urlToImage": "https://storage.googleapis.com/afs-prod/media/7f2f79c86faf4c0192bc81c739005470/3000.jpeg", "publishedAt": "2021-07-17T06:11:57Z", "content": "BERLIN (AP) The death toll from disastrous flooding in Western Europe rose above 150 on Saturday as rescue workers toiled to clear up the devastation revealed by receding water and prevent further da… [+3697 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks and Aya Elamroussi, CNN", "title": "'Hollywood Ripper' serial killer sentenced to death for the murders of 2 women and attempted murder of another - CNN ", "description": "The man known as the \"Hollywood Ripper\" was sentenced to death on Friday in the murders of two women and the attempted murder of another, a court spokesperson told CNN.", "url": "https://www.cnn.com/2021/07/17/us/hollywood-ripper-death-sentence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210717001916-michael-gargiulo-sentencing-0716-super-tease.jpg", "publishedAt": "2021-07-17T05:24:00Z", "content": null}, {"source": {"id": null, "name": "ESPN"}, "author": null, "title": "Reports - Shohei Ohtani donated Home Run Derby earnings to Los Angeles Angels' staff members - ESPN", "description": "Shohei Ohtani, who earned $150,000 for competing in the Home Run Derby, donated the money to members of the Los Angeles Angels' support staff on Friday, according to multiple reports.", "url": "https://www.espn.com/mlb/story/_/id/31830562/shohei-ohtani-donated-home-run-derby-earnings-los-angeles-angels-staff-members", "urlToImage": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0713%2Fr879701_1296x729_16%2D9.jpg", "publishedAt": "2021-07-17T04:42:08Z", "content": "ANAHEIM, Calif. -- Shohei Ohtani donated his winnings from this week's Home Run Derby to members of the Los Angeles Angels' support staff, according to multiple reports Friday.\r\nThe news was first re… [+923 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Bob Christie", "title": "AP: Few AZ voter fraud cases, discrediting Trump's claims - Associated Press", "description": "PHOENIX (AP) — Arizona county election officials have identified fewer than 200 cases of potential voter fraud out of more than 3 million ballots cast in last year's presidential election, further discrediting former President Donald Trump's claims of a stole…", "url": "https://apnews.com/article/business-government-and-politics-only-on-ap-election-2020-8260008a320b6c96a15e6884af3fa474", "urlToImage": "https://storage.googleapis.com/afs-prod/media/6cb8e888b3504625a9f4071c1556ff28/3000.jpeg", "publishedAt": "2021-07-17T04:24:25Z", "content": "PHOENIX (AP) Arizona county election officials have identified fewer than 200 cases of potential voter fraud out of more than 3 million ballots cast in last years presidential election, further discr… [+8293 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brie Stimson", "title": "Some San Francisco-area restaurants reinstate mask requirements, cut unvaccinated workers over new guidance - Fox News", "description": "After San Francisco Bay Area health officials issued new guidance Friday recommending that everyone – even those who are vaccinated – should wear masks indoors, many restaurants are now reportedly requiring them again for their employees.", "url": "https://www.foxnews.com/lifestyle/san-francisco-restaurants-masks-unvaccinated-workers-new-guidance", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/GettyImages-1217921213.jpg", "publishedAt": "2021-07-17T04:05:04Z", "content": "After San Francisco Bay Area health officials issued new guidance Friday recommending that everyone even those who are vaccinated should wear masks indoors, many restaurants are now reportedly requir… [+2112 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julius Young", "title": "Scott Disick ‘keeping away’ from Kourtney Kardashian-Travis Barker romance during Hamptons getaway: source - Fox News", "description": "The Lord, 38, is currently vacationing in the Hamptons where he’s made the mad dash with his 20-year-old flame, model Amelia Hamlin – and the pair are said to be enjoying a swell time.", "url": "https://www.foxnews.com/entertainment/scott-disick-keeping-away-from-kourtney-kardashian-travis-barker-romance-during-hamptons-getaway-source", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/Disick-Kardashian-Barker_Getty.jpg", "publishedAt": "2021-07-17T03:51:07Z", "content": "Scott Disick is trying his best to stay far away from the ever circulating news centered on his ex-girlfriend Kourtney Kardashians fast-moving relationship with Travis Barker.\r\nThe Lord, 38, is curre… [+3152 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/mariella-moon", "title": "Amazon convinces Apple to remove review analyzer Fakespot from the App Store - Engadget", "description": "Fakespot, an app that analyzes Amazon reviews to determine which ones are fake, is no longer available for iOS..", "url": "https://www.engadget.com/amazon-apple-fakespot-app-store-033147651.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-07/f7522110-e6a1-11eb-bfff-edb16fd0a4d3", "publishedAt": "2021-07-17T03:34:46Z", "content": "Fakespot, an app that analyzes Amazon reviews to determine which ones are fake, is no longer available for iOS. Amazon has successfully convinced Apple to remove it from the App Store after the compa… [+2411 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ben Beaumont-Thomas", "title": "Biz Markie, rapper known for Just a Friend, dies at age 57 - The Guardian", "description": "Hip-hop star known for his personality, beatboxing and freestyle skills scored his biggest hit in 1989", "url": "https://amp.theguardian.com/music/2021/jul/16/hip-hop-star-biz-markie-rapper-dies-just-a-friend", "urlToImage": null, "publishedAt": "2021-07-17T02:27:00Z", "content": "Hip-hopHip-hop star known for his personality, beatboxing and freestyle skills scored his biggest hit in 1989\r\nBiz Markie, the New York rapper, beatboxer and producer, has died at age 57.\r\nMarkies re… [+4821 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joseph Wulfsohn", "title": "Biden blasted for accusing Facebook of 'killing people' over COVID misinformation as WH partners with Big Tech - Fox News", "description": "President Biden sparked backlash on social media Friday after he accused Facebook of \"killing people\" – as the White House's partnership with Big Tech companies to crack down on so-called coronavirus \"misinformation\" was raising major free-speech concerns amo…", "url": "https://www.foxnews.com/media/biden-facebook-killing-people-covid-misinformation", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/06/AP21160451290550.jpg", "publishedAt": "2021-07-17T02:11:12Z", "content": "President Biden sparked backlash on social media Friday after he accused Facebook of \"killing people\" as the White House's partnership with Big Tech companies to crack down on so-called coronavirus \"… [+3090 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez and Tierney Sneed, CNN", "title": "What to know about DACA being ruled illegal - CNN ", "description": "A federal judge in Texas on Friday ruled that the Deferred Action for Childhood Arrivals program is unlawful. The decision, by US District Judge Andrew Hanen of the Southern District of Texas, injected uncertainty into the lives of hundreds of thousands of yo…", "url": "https://www.cnn.com/2021/07/16/politics/what-to-know-daca-ruling-illegal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200619100027-primera-daca-super-tease.jpg", "publishedAt": "2021-07-17T02:02:00Z", "content": "(CNN)A federal judge in Texas on Friday ruled that the Deferred Action for Childhood Arrivals program is unlawful. The decision, by US District Judge Andrew Hanen of the Southern District of Texas, i… [+3757 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aylin Woodward", "title": "Human genome mostly overlaps with Neanderthals, other human ancestors - Business Insider", "description": "A study suggests just 1.5% to 7% of the human genome is unique to our species. The remaining genes overlap with Neanderthal and other human ancestors.", "url": "https://www.businessinsider.com/human-genome-overlaps-neanderthals-ancestors-2021-7", "urlToImage": "https://i.insider.com/60f1cec47b0ec5001800a862?width=1200&format=jpeg", "publishedAt": "2021-07-17T01:51:26Z", "content": "Humans like to think they're special, but our genes suggest that's far from the case.\r\nNo more than 7% of the human genome is unique to Homo sapiens, according to a study published Friday in the jour… [+3559 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Sam Raskin", "title": "Texas man returns from Nigeria with case of monkeypox - New York Post ", "description": "A Dallas resident has been hospitalized under isolation after returning from Nigeria with the first-ever Texas case of monkeypox, health officials revealed Friday.", "url": "https://nypost.com/2021/07/16/texas-man-returns-from-nigeria-with-case-of-monkeypox/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/07/monkeypox-dallas-index.jpg?quality=90&strip=all&w=1200", "publishedAt": "2021-07-17T01:51:00Z", "content": "A rare case of monkeypox has been confirmed in a Texas resident who recently traveled from Nigeria, health officials said Friday.\r\nThe person has been hospitalized and isolated in Dallas, and is in s… [+1690 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Louis Casiano", "title": "Los Angeles County sheriff will not enforce new mask mandate: ‘Not backed by science’ - Fox News", "description": "Los Angeles County Sheriff Alex Villanueva said Friday he will not use his department to enforce a mandatory indoor mask requirement set to take effect this weekend amid a spike in COVID-19 cases across the county since its reopening.", "url": "https://www.foxnews.com/us/los-angeles-county-sheriff-mask-mandate", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/08/AP20226730618901.jpg", "publishedAt": "2021-07-17T01:27:24Z", "content": "Los Angeles County Sheriff Alex Villanueva said Friday he will not use his department to enforce a mandatory indoor mask requirement set to take effect this weekend amid a spike in COVID-19 cases acr… [+2642 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Richard Lawler", "title": "WhatsApp tests encrypted cloud backups on Android - The Verge", "description": "WhatsApp communications are encrypted from end-to-end between the sender and receiver. However, they’re vulnerable at rest on your device or in the cloud where authorities can access them with a search warrant. Now the service is testing encryption in the clo…", "url": "https://www.theverge.com/2021/7/16/22580800/icloud-google-drive-encrypted-whatsapp-cloud-backup", "urlToImage": "https://cdn.vox-cdn.com/thumbor/y1dBxtHPiilVCibNWHeWkW-FV1g=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22245550/acastro_210119_1777_whatsapp_0002.jpg", "publishedAt": "2021-07-17T01:20:19Z", "content": "Read the fine print before you switch it on\r\nIllustration by Alex Castro / The Verge\r\nWhen youre using WhatsApp your messages are encrypted end-to-end, which means prying eyes cant easily see whats i… [+1145 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Dan Fastenberg", "title": "Moon 'wobble,' climate change seen as driving coastal flooding in 2030s - Reuters", "description": "U.S. coastlines will face increasing flooding in the mid-2030s thanks to a regular lunar cycle that will magnify rising sea levels caused by climate change, according to research led by NASA scientists.", "url": "https://www.reuters.com/world/us/moon-wobble-climate-change-seen-driving-coastal-flooding-2030s-2021-07-16/", "urlToImage": "https://www.reuters.com/resizer/K0LwEpyeqLXYEC1E8TMlHyRvr3o=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/AFJB3L5OWBISLD5K6DIVGUZU4Y.jpg", "publishedAt": "2021-07-17T01:06:00Z", "content": "July 16 (Reuters) - U.S. coastlines will face increasing flooding in the mid-2030s thanks to a regular lunar cycle that will magnify rising sea levels caused by climate change, according to research … [+2468 chars]"}]}